Revit 2026 API

# ParameterDownloadOptionsSetGroupTypeId Method

---

Set properties palette group identifier.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetGroupTypeId(
	ForgeTypeId groupTypeId
)
```
```vb
Public Sub SetGroupTypeId (
	groupTypeId As ForgeTypeId
)
```
```cpp
public:
void SetGroupTypeId(
	ForgeTypeId^ groupTypeId
)
```
```fsharp
member SetGroupTypeId :
        groupTypeId : ForgeTypeId -> unit
```

#### Parameters

groupTypeId ForgeTypeId

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

ParameterDownloadOptions Class

Autodesk.Revit.DB Namespace